## Import Library & Dataset

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
#import Dataset
iq = pd.read_csv('IQ_level.csv')
iq.head()

   rank     country   IQ  education_expenditure  avg_income  avg_temp
0     1  Hong Kong   106                 1283.0     35304.0      26.2
1     2       Japan  106                 1340.0     40964.0      19.2
2     3   Singapore  106                 1428.0     41100.0      31.5
3     4     Taiwan   106                    NaN         NaN      26.9
4     5       China  104                  183.0      4654.0      19.1

In [4]:
iq.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 108 entries, 0 to 107
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   rank                   108 non-null    int64
 1   country                108 non-null    object
 2   IQ                     108 non-null    int64
 3   education_expenditure  103 non-null    float64
 4   avg_income             106 non-null    float64
 5   avg_temp               108 non-null    float64
dtypes: float64(3), int64(2), object(1)
memory usage: 5.2+ KB

In [3]:
iq.describe()

            rank          IQ  education_expenditure     avg_income    avg_temp
count  108.00000  108.000000             103.000000     106.000000  108.000000
mean    54.50000   85.972222             903.058252   17174.650943   23.858333
std     31.32092   12.998532            1166.625835   20871.092773    8.392232
min      1.00000   51.000000               1.000000     316.000000    0.400000
25%     27.75000   78.750000              81.500000    2263.250000   17.250000
50%     54.50000   88.000000             336.000000    7533.000000   25.850000
75%     81.25000   97.000000            1360.000000   30040.000000   31.275000
max    108.00000  106.000000            5436.000000  108349.000000   36.500000

In [6]:
iq.isna().sum()

rank                     0
country                  0
IQ                       0
education_expenditure    5
avg_income               2
avg_temp                 0
dtype: int64

In [7]:
iq.duplicated().sum()

0